icyphy/ptII/ptolemy/apps/ptidesBareIron/PtidesOS/boards/ek-lm3s8962/SimplePtidesOS/SimplePtidesOS.c
    //add an event
    Event *compare_event = EVENT_QUEUE_HEAD;
    Event *before_event  = EVENT_QUEUE_HEAD;
    //move across the link until we find an event with larger tag, or stop at the end.
	addeventcount++;
    while (1)
	{
        if (compare_event == NULL)
		{
			RIT128x96x4StringDraw("ce==null",   12,90,15);
            break;
		}
        else if (stampedTag.timestamp < compare_event->Tag.timestamp)
		{
		    RIT128x96x4StringDraw("opt2",   12,90,15);
            break;
		}
        else if ((stampedTag.timestamp == compare_event->Tag.timestamp) && 
		((stampedTag.microstep < compare_event->Tag.microstep)||(stampedTag.microstep == compare_event->Tag.microstep)))
			{
			RIT128x96x4StringDraw("opt3",   12,90,15);
            break;
			}
        else {
            if (compare_event != before_event)
		        {
				RIT128x96x4StringDraw("inifaddedEvent",   10,90,15);
				before_event = before_event->next;
				
				}
			RIT128x96x4StringDraw("lastelseaddedEvent",   12,90,15);
			
			compare_event = compare_event->next;
			RIT128x96x4StringDraw("22lastelseaddedEvent",   12,90,15);
		//	break;
        }
    }
            
    newEvent->next = compare_event;
	RIT128x96x4StringDraw("check1addedEvent",   12,90,15);
    if (compare_event == before_event)
	{
        EVENT_QUEUE_HEAD = newEvent;
    }
    else if (compare_event != before_event)
	{
        before_event->next = newEvent;
    }
    else {
		RIT128x96x4StringDraw("diedinaddedEvent",   12,90,15);
        die("");
    }

// now add event to the deadline queue
compare_event = DEADLINE_QUEUE_HEAD;
before_event  = DEADLINE_QUEUE_HEAD;


   while (1)
	{
        if (compare_event == NULL)
		{
			RIT128x96x4StringDraw("ce==null",   12,90,15);
            break;
		}
        else if ((deadline < compare_event->actorFrom->deadline)||(deadline < compare_event->actorFrom->deadline))
		{
		    RIT128x96x4StringDraw("opt2",   12,90,15);
            break;
		}
      else {
            if (compare_event != before_event)
		        {
				RIT128x96x4StringDraw("inifaddedEvent",   10,90,15);
				before_event = before_event->next;
				
				}
			RIT128x96x4StringDraw("lastelseaddedEvent",   12,90,15);
			
			compare_event = compare_event->next;
			RIT128x96x4StringDraw("22lastelseaddedEvent",   12,90,15);
		//	break;
        }
    }
            
    newEvent->next = compare_event;
	RIT128x96x4StringDraw("check1addedEvent",   12,90,15);
    if (compare_event == before_event)
	{
        DEADLINE_QUEUE_HEAD = newEvent;
    }
    else if (compare_event != before_event)
	{
        before_event->next = newEvent;
    }
    else {
		RIT128x96x4StringDraw("diedinaddedEvent",   12,90,15);
        die("");
    }

	RIT128x96x4StringDraw("addedEvent          ",   12,90,15);
	sprintf(str,"%d",addeventcount);
	RIT128x96x4StringDraw(str,   90,90,15);

}

unsigned int alreadyFiring(Actor* actor) {
	return actor->firing;
}

/**
 * Set the firing flag of the actor, indicate that the actor is currenting being fired.
 */
void currentlyFiring(Actor* actor) 
{
	actor->firing = 1;
}
//calculates the deadline for an actor
//should generally only be called initially on a sensor
//sets the deadline of the actor along the way...
//traverses to actuator and then backs up to assign deadlines
long deadline(Actor *this_actor)
{
	if(this_actor == NULL)
		return MAX_DEADLINE_VAL;
	if(this_actor->type == 'a')
	{
		this_actor->deadline = 0;
		return 0;
	}
	this_actor->deadline = this_actor->model_delay+ min(deadline(this_actor->nextActor1),deadline(this_actor->nextActor2));
	return this_actor->deadline;

}
/**
 This function is called when an error occures.
 */
void die(char *mess) { 
	perror(mess); 
	return; 
}

static void DisplayIntStatus(void)
{
    unsigned long ulTemp;
    char pcBuffer[4];

    //
    // Display the currently active interrupts.
    //
    ulTemp = HWREG(NVIC_ACTIVE0);
    pcBuffer[0] = (ulTemp & 1) ? '1' : ' ';
    pcBuffer[1] = (ulTemp & 2) ? '2' : ' ';
    pcBuffer[2] = (ulTemp & 4) ? '3' : ' ';
    pcBuffer[3] = '\0';
	RIT128x96x4Clear();
    RIT128x96x4StringDraw(pcBuffer, 12,16,15);
	
    //
    // Display the currently pending interrupts.
    //
    ulTemp = HWREG(NVIC_PEND0);
    pcBuffer[0] = (ulTemp & 1) ? '1' : ' ';
    pcBuffer[1] = (ulTemp & 2) ? '2' : ' ';
    pcBuffer[2] = (ulTemp & 4) ? '3' : ' ';
    RIT128x96x4StringDraw(pcBuffer, 12,24,15);
}


//*****************************************************************************
//
// Delay for the specified number of seconds.  Depending upon the current
// SysTick value, the delay will be between N-1 and N seconds (i.e. N-1 full
// seconds are guaranteed, along with the remainder of the current second).
//
//*****************************************************************************
// mthomas: added static 
static void Delay(unsigned long ulSeconds)
{
    //
    // Loop while there are more seconds to wait.
    //
    while(ulSeconds--)
    {
        //
        // Wait until the SysTick value is less than 1000.
        //
        while(SysTickValueGet() > 1000)
        {
        }

        //
        // Wait until the SysTick value is greater than 1000.
        //
        while(SysTickValueGet() < 1000)
        {
        }
    }
}



//FIXME: which interrupt(s) should I disable/enable?
void disableInterrupts() {
	IntMasterDisable();
	//IntDisable(INT_UART0);
	//UARTIntDisable(UART0_BASE, UART_INT_RX | UART_INT_RT);
	return;
}

void enableInterrupts() {
	IntMasterEnable();
    //IntEnable(INT_UART0);
    //UARTIntEnable(UART0_BASE, UART_INT_RX | UART_INT_RT);
	return;
} 
/** 
 * fire_actor checks if static timing analysis is needed.
 * if it is, static timing analysis is called, and returns
 * if it's not, firing method of the actor specified by the event is called
 */
void fireActor(Event* currentEvent)
{
	
