icyphy/ptII/ptolemy/apps/ptidesBareIron/PtidesOS/boards/ek-lm3s8962/SimplePtidesOS/SimplePtidesOS.c
    Actor* fire_this = currentEvent->actorToFire;
	//printf("inside fireActor\n");
	//FIXME: USE THIS INSTEAD!! char temp_type[3] = fire_this->type;
	if (fire_this->fireMethod != NULL) 
	{
	//	printf("about to call the fire method of the fireActor \n");
	//	RIT128x96x4StringDraw("abouttofire...", 12, 72, 15);
		(fire_this->fireMethod)(fire_this, currentEvent);
	//	RIT128x96x4StringDraw("justFired", 12, 72, 15);
	} else {
		//printf("actor I'm supposed to fire is null. calling die now. bye \n");
		RIT128x96x4StringDraw("nullfiremethod", 12, 72, 15);
		die("no such method, cannot fire\n");
	}
	fire_this->firing = 0;
	//printf("done firing the actor\n");
    RIT128x96x4StringDraw("endFireActor", 12, 72, 15);
	fireActorCount++;
	sprintf(str,"%d",fireActorCount);
	RIT128x96x4StringDraw(str, 85, 72, 15);
    
}
 /**
 * This is the fire method for actuator
 * The actuator is used to check if the event received output has met the 
 * deadline by comparing the current time with the timestamp.
 * Note that it actually use the hardware to do the actuation.
 * Note that this actually is not a terminating actor, actuation is not done in
 * this method, instead, it's done by actuator_run().
 * Since it's not a terminating actor, the event is not popped.
 *
 */
void fireActuator(Actor* this_actuator, Event* thisEvent) 
{
	long long currentTime = getCurrentPhysicalTime();
    Tag *stampedTag = &(thisEvent->Tag);
	 fireActuatorCount++;
	 
    // Compare time with taged time, if not safe to actuate, then add events
    // and wait until time to actuate. If safe to actuate, actuate now.
	if (stampedTag->timestamp > currentTime)
    {
//        printf("\nthe actuator was able to produce event ON TIME!!!! \n");
//        printf("the timestamped tag is: %.9d.%9.9d %i \n", stampedTag->secs, stampedTag->nsecs, stampedTag->microstep);
//        printf("the current time is:    %.9d.%9.9d %i \n", secs, nsecs, microstep);

		setActuationInterrupt(stampedTag->timestamp);		
	}											   
    else
    {
//        printf("\nthe timing of the system was NOT MET!!!!! \n");
//        printf("the timestamped tag is: %.9d.%9.9d %i \n", stampedTag->secs, stampedTag->nsecs, stampedTag->microstep);
//        printf("the current time is:    %.9d.%9.9d %i \n", secs, nsecs, microstep);

		// FIXME: do something!
    }
  	this_actuator->firing = 0;
	RIT128x96x4StringDraw("actuatorfired", 12,60,15);
	sprintf(str,"%d",fireActuatorCount);
	RIT128x96x4StringDraw(str, 90,60,15);	   

}


/**
 * This function is basically the same as clock_init(), expect only this 
 * function is called through an event, thus we use addEvent() instead 
 * of event_insert() in this case.
 */
void fireClock(Actor* this_clock, Event* thisEvent) {

	long time = CK1_TIME;
	Event* myNewEvent = newEvent();
	//Event* new_event2;	    
    time += CLOCK_PERIOD;

    //Notice orderTag and realTag are set to different things:
    //since the event queue is ordered by orderTag, we these events to 
	//execute now.
	//However realTag is the real timestamp to appear at the output.
    myNewEvent->thisValue.doubleValue = 0;
    myNewEvent->Tag.timestamp = time;
    myNewEvent->Tag.microstep = 0;   //FIXME
    myNewEvent->actorToFire = this_clock->nextActor1;
    myNewEvent->actorFrom = this_clock;
	myNewEvent->name =2;

    addEvent(myNewEvent);
	CK1_BUF_SIZE++;

    if (this_clock->nextActor2 != NULL) {
        Event* newEvent2 = newEvent();
		*newEvent2 = *myNewEvent;
        newEvent2->actorToFire = this_clock->nextActor2;
        addEvent(newEvent2);
    }
	this_clock->firing=0;
	clockfirecount++;
	RIT128x96x4StringDraw("clockfired", 12,12,15);
	sprintf(str,"%d",clockfirecount);
	RIT128x96x4StringDraw(str, 100,12,15);
    return;
}

/** 
 * This is the fire method for computation.
 * Computation method do not have any real functionality here, where we simply
 * set our event queue to fire the next actor.
 */
void fireComputation(Actor* this_computation, Event* thisEvent) 
{

	double thisDouble;
	Event* myNewEvent = newEvent();
	int computation_delay = 10000;
	fireComputationCount++;
	// I'm not sure if this is the correct think to do but I noticed that 
	// the timestamp wasn't set for the new event that was created
	//RIT128x96x4StringDraw("begincomputationFire",12,  24, 15);

	myNewEvent->Tag.timestamp = thisEvent->Tag.timestamp + computation_delay;
    myNewEvent->Tag.microstep = 0;   //FIXME
    //myNewEvent->actorToFire = this_computation->nextActor1;
    //myNewEvent->actorFrom = this_computation;

	// this may need to be added to the sectoin that adds newEvent2
	//end code I added in hopes that this will work
        
	thisDouble = thisEvent->thisValue.doubleValue;
    thisDouble++;

	myNewEvent->thisValue.doubleValue = thisDouble;
    myNewEvent->actorToFire = this_computation->nextActor1;
    myNewEvent->actorFrom = this_computation;
	//RIT128x96x4StringDraw("1begincomputationFire",12,  24, 15);
    //arbitrarily delay either 1/4 of a sec or 1/2 of a sec or none.
	addEvent(myNewEvent);
	//	RIT128x96x4StringDraw("2begincomputationFire",12,  24, 15);
    if (this_computation->nextActor2 != NULL)
    {
        Event* newEvent2 = newEvent();
		*newEvent2= *myNewEvent;  
        newEvent2->actorToFire = this_computation->nextActor2;
        addEvent(newEvent2);
    }
	this_computation->firing =0 ;
    RIT128x96x4StringDraw("computationFired      ",0,  24, 15);
	sprintf(str,"%d",fireComputationCount);
	RIT128x96x4StringDraw(str, 90,24,15);
//	printf("computation fired\n");
  return;
}

/** 
 * This is the fire method for merge actor.
 * This firing method transfer the event at the input and put it to the output.
 * It also prints the current timestamp, and which actor it is from.
 * Since it is not a terminating actor, no need to pop event.
 * Only possibility to add event is when it has more than one output.
 * A merge actor may have more than one input.
 */
void fireMerge(Actor* this_merge, Event* thisEvent) 
{

//    printf("THIS IS THE FINAL OUTPUT OF THE MERGE Actor: \n");
//    printf("MAKE SURE THE TagS OF THESE EVENTS ARE IN ORDER: the tag on the current value are: %.9d.%9.9d %i \n", 
//		thisEvent->realTag.secs, thisEvent->Tag.nsecs, thisEvent->Tag.microstep);
//    printf("THIS OUTPUT WAS FROM Actor: %c%c%c\n", 
//		thisEvent->actorFrom->type[0], thisEvent->actorFrom->type[1], thisEvent->actorFrom->type[2]);
	
	Event* myNewEvent = newEvent();
	//printf("inside fireMerge \n");
	*myNewEvent = *thisEvent;	    
    myNewEvent->actorToFire = this_merge->nextActor1;
    myNewEvent->actorFrom = this_merge;


	addEvent(myNewEvent);

    if (this_merge->nextActor2 != NULL)
    {
        Event* newEvent2 = newEvent();
		*newEvent2 = *myNewEvent;     
        newEvent2->actorToFire = this_merge->nextActor2;
        addEvent(newEvent2);
    }
	this_merge->firing = 0;
	fireMergedCount++;
	RIT128x96x4StringDraw("mergeFired", 12,48,15);	   
	sprintf(str,"%d",fireMergedCount);
	RIT128x96x4StringDraw(str, 90,48,15);
	//printf("mergeFired \n");
	return;

