icyphy/ptII/ptolemy/apps/ptidesBareIron/PtidesOS/boards/ek-lm3s8962/SimplePtidesOS/SimplePtidesOS.c
}

/** 
 * This is the fire method for model_delay actor.
 * model_delay actor increase the current realTag timestamp by the the 
 * parameter MODEL_DELAY_SECS, where MODEL_DELAY_SECS is greater or equal 
 * to maximum delay from the source of the event to the sink.
 * At the same time, the orderTag is increased by BOUNDED_DELAY, since
 * this is the delay between the sensor actor and the merge actor.
 * Since timestamps are modified in this process, event_pop() and addEvent() 
 * needs to be called.
 * Because model_delay is also a transmitter through the network, socket
 * programming is used.
 */
void fireModelDelay(Actor* this_model_delay, Event* thisEvent) {

	unsigned int model_delay = 0;
/*
	if (this_model_delay ->type[2] == '1') {
		model_delay_secs = MODEL_DELAY1_SECS;
		model_delay_nsecs = MODEL_DELAY1_NSECS;
		bounded_delay_secs = BOUNDED_DELAY1_SECS;
		bounded_delay_nsecs = BOUNDED_DELAY1_NSECS;
	}
	else if (this_model_delay ->type[2] == '2') {
		model_delay_secs = MODEL_DELAY2_SECS;
		model_delay_nsecs = MODEL_DELAY2_NSECS;
		bounded_delay_secs = BOUNDED_DELAY2_SECS;
		bounded_delay_nsecs = BOUNDED_DELAY2_NSECS;
	}
	else if (this_model_delay ->type[2] == '3') {
		model_delay_secs = MODEL_DELAY3_SECS;
		model_delay_nsecs = MODEL_DELAY3_NSECS;
		bounded_delay_secs = BOUNDED_DELAY3_SECS;
		bounded_delay_nsecs = BOUNDED_DELAY3_NSECS;
	}
	else {
		printf("this model delay does not exist!\n");
		exit(1);
	}
*/

	Event* myNewEvent = newEvent();
//	printf("inside fireModelDelay \n");
//RIT128x96x4StringDraw("insidemodelDelayFired", 12,36,15);
	fireModelDelayCount++;	
	myNewEvent->Tag.timestamp = thisEvent->Tag.timestamp + model_delay;
    myNewEvent->Tag.microstep = 0;   //FIXME
    myNewEvent->actorToFire = this_model_delay->nextActor1;
    myNewEvent->actorFrom = this_model_delay;

	addEvent(myNewEvent);
    if (this_model_delay->nextActor2 != NULL)
    {
        Event* newEvent2 = newEvent();
		*newEvent2 = *myNewEvent;   
        newEvent2->actorToFire = this_model_delay->nextActor2;
        addEvent(newEvent2);
    }
    this_model_delay->firing=0;
	RIT128x96x4StringDraw("modelDelayFired", 12,36,15);
	sprintf(str,"%d",fireModelDelayCount);
	RIT128x96x4StringDraw(str, 90,36,15);
//	printf("modelDelayFired");
	 return;
}

 
/** 
 * This is the initialization method for sensor actor.
 * Initialize the sensor actor to setup receiving function through another 
 * thread, it then create a new event and calls processEvent()
 */
void fireSensor(Actor* this_sensor)     //this listens for the next signal to sense again
{
	long time;
    Event* myNewEvent;
 	myNewEvent = newEvent();
	sensorCount++;
    //get the current time
    time = getCurrentPhysicalTime();

    // Set a time trigger from now

    myNewEvent->Tag.timestamp = time;
    myNewEvent->Tag.microstep = 0;	//FIXEM
    myNewEvent->thisValue.doubleValue = 10*sensorCount;//time;
    myNewEvent->actorToFire = this_sensor->nextActor1;
    myNewEvent->actorFrom = this_sensor;
	
	
    //now put the created event into the queue
    //BUT HOW DO I TRACK THE START OF THE EVENT QUEUE??? --global variable
    addEvent(myNewEvent);
    if (this_sensor->nextActor2 != NULL)
    {
        Event* newEvent2 = newEvent();
		*newEvent2 = *myNewEvent;     
        newEvent2->actorToFire = this_sensor->nextActor2;
       addEvent(newEvent2);
    } 
		RIT128x96x4StringDraw("initsensor", 12,12,15);
		sprintf(str,"%d",sensorCount);
		RIT128x96x4StringDraw(str, 90,12,15);

 }
 
void freeEvent(Event * thisEvent)
{
	eventMemory[thisEvent->inUse].inUse = 36;

}

long long getCurrentPhysicalTime() {  
	// returns seconds elapsed.. number of times the counter has rolled over.
	return (seconds*8000000) + SysTickValueGet();
}

//*****************************************************************************
//
// This function returns a random number, using the functions in random.c.
//
//*****************************************************************************
UInteger16 getRand(UInteger32 *seed)
{
    unsigned long ulTemp;
    UInteger16 uiTemp;

    //
    // Re-seed the random number generator.
    //
    RandomAddEntropy(*seed);
    RandomSeed();

    //
    // Get a random number and return a 16-bit, truncated version.
    //
    ulTemp = RandomNumber();
    uiTemp = (UInteger16)(ulTemp & 0xFFFF);
    return(uiTemp);
}

/** determines whether the event to fire this current actor is of higher priority than
 * whatever even that's currently being executed.
 * FIXME: other than making sure this actor is not currently firing, we also need to make
 * sure the event to fire is not of higher priority.
 */
unsigned int higherPriority(Actor* actor) {
	return alreadyFiring(actor)? FALSE : TRUE;
}

/** 
 * This is the initilization for the clock actor.
 * its functionality is to provide events with intervals specified by 
 * CLOCK_PERIOD_SECS/NSECS.
 * At one time, CLOCK_EVNTS number of events are produced at a time, and they 
 * can be executed momentarily.
 * when the deadline of the last event that was produced has passed
 * CLOCK_EVENTS number of events are again produced by a event added into the event queue
 */
void initializeClock(Actor *this_clock)
{
    long long currentTime = getCurrentPhysicalTime();

    Event* myNewEvent = newEvent();				

    //CLOCK_PERIOD specifies the period
    currentTime += CLOCK_PERIOD;   

    //notice orderTag and realTag are set to different things:
    //since the event queue is ordered by orderTag, we these events to execute NOW
    //however realTag is the real timestamp to appear at the output
    myNewEvent->Tag.timestamp = currentTime;
    myNewEvent->Tag.microstep = 0;   //FIXME
    myNewEvent->thisValue.doubleValue = 0;
    myNewEvent->actorToFire = this_clock;//->nextActor1;
    myNewEvent->actorFrom = this_clock;

    addEvent(myNewEvent);

	CK1_TIME = currentTime;
	/*
    if (this_clock->nextActor2 != NULL)
    {
        Event* newEvent2 = newEvent();
		*newEvent2 = *myNewEvent;    
        newEvent2->actorToFire = this_clock->nextActor2;
        addEvent(newEvent2);
    } */
	RIT128x96x4StringDraw("initclock", 12,12,15);
}

