icyphy/ptII/ptolemy/apps/ptidesBareIron/PtidesOS/boards/ek-lm3s8962/SimplePtidesOS/SimplePtidesOS.c
void initializeMemory()
{
	int i;
	locationCounter = 0;
						  
	for(i =0; i< 35; i++)
	{
	// event is "freed and can be returned by newEvent"
			eventMemory[i].inUse = 36; 
	}
}
void interruptInit(void) {
	//
    // Enable the interrupts.
    //
    IntEnable(INT_GPIOA);
    IntEnable(INT_GPIOB);
    IntEnable(INT_GPIOC); 	
	IntEnable(INT_GPIOD); 	
	IntEnable(INT_GPIOE); 	
	IntEnable(INT_GPIOF); 	
	IntEnable(INT_GPIOG);
	
	//
    // Set the interrupt priorities so they are all equal.
    // Even though they are set to different values, there is actually a strict
	// priority among them. B > C > D > ... > G, where B > C means B is of higher
	// priority.
	// A, which is in charge of triggering and allocating to different interrupts
	// has the highest priority among them all, but the timer  should still have higher
	// priority than A, though the timer interrupt should trigger A.
	// Here, only the first 3 bits of the priority is looked at, i.e., 0x20 = 0010 0000 = 001
	// 0x40 = 0100 0000 = 010.
    IntPrioritySet(INT_GPIOA, 0x20);
    IntPrioritySet(INT_GPIOB, 0x40);
    IntPrioritySet(INT_GPIOC, 0x40);
	IntPrioritySet(INT_GPIOD, 0x40);
	IntPrioritySet(INT_GPIOE, 0x40);
	IntPrioritySet(INT_GPIOF, 0x40);
	IntPrioritySet(INT_GPIOG, 0x40);
	// FIXME: don't I need IntRegister to make sure the corresponding interrupt handler functions are called?
	// I think this has been done in start.s, but we should probably change that.
 
}

//*****************************************************************************
//
// This is the handler for INT_GPIOB. 
// IntGPIOa would trigger this.
//
//*****************************************************************************
void IntGPIOg(void)
{

    // Not necessarily needed.
    // Set PD2 high to indicate entry to this interrupt handler.
    //
    GPIOPinWrite(GPIO_PORTB_BASE, GPIO_PIN_2, GPIO_PIN_2);

    // Not necessarily needed.
    // Put the current interrupt state on the OLED.
    //
    DisplayIntStatus();

	disableInterrupts();
	// fire the actor sent by GPIOa.
    (*IntFuncPtr[0])(IntActorArg[0]);

	enableInterrupts();

	STOP_SOURCE_PROCESS = TRUE;

	// then do processAvailableEvents();	 				 	
	processAvailableEvents();

    // Put the current interrupt state on the OLED.
    //
    DisplayIntStatus();

    // Not necessary
    // Set PD2 low to indicate exit from this interrupt handler.
    //
    GPIOPinWrite(GPIO_PORTB_BASE, GPIO_PIN_2, 0);

	InterruptPriorityLevel--;
}

//*****************************************************************************
//
// This is the handler for INT_GPIOB. 
// IntGPIOa would trigger this.
//
//*****************************************************************************												 	
void IntGPIOf(void)
{

    // Not necessarily needed.
    // Set PD2 high to indicate entry to this interrupt handler.
    //
    GPIOPinWrite(GPIO_PORTB_BASE, GPIO_PIN_2, GPIO_PIN_2);

    // Not necessarily needed.
    // Put the current interrupt state on the OLED.
    //
    DisplayIntStatus();

	disableInterrupts();
	// fire the event sent by GPIOa.
    (*IntFuncPtr[1])(IntActorArg[1]);

	enableInterrupts();

	STOP_SOURCE_PROCESS = TRUE;

	// then do processAvailableEvents();	 				 	
	processAvailableEvents();

    // Put the current interrupt state on the OLED.
    //
    DisplayIntStatus();

    // Not necessary
    // Set PD2 low to indicate exit from this interrupt handler.
    //
    GPIOPinWrite(GPIO_PORTB_BASE, GPIO_PIN_2, 0);

	InterruptPriorityLevel--;
}

//*****************************************************************************
//
// This is the handler for INT_GPIOB. 
// IntGPIOa would trigger this.
//
//*****************************************************************************
void IntGPIOe(void)
{

    // Not necessarily needed.
    // Set PD2 high to indicate entry to this interrupt handler.
    //
    GPIOPinWrite(GPIO_PORTB_BASE, GPIO_PIN_2, GPIO_PIN_2);

    // Not necessarily needed.
    // Put the current interrupt state on the OLED.
    //
    DisplayIntStatus();

	disableInterrupts();
	// fire the event sent by GPIOa.
    (*IntFuncPtr[2])(IntActorArg[2]);

	enableInterrupts();

	STOP_SOURCE_PROCESS = TRUE;

	// then do processAvailableEvents();	 				 	
	processAvailableEvents();

    // Put the current interrupt state on the OLED.
    //
    DisplayIntStatus();

    // Not necessary
    // Set PD2 low to indicate exit from this interrupt handler.
    //
    GPIOPinWrite(GPIO_PORTB_BASE, GPIO_PIN_2, 0);

	InterruptPriorityLevel--;
}

//*****************************************************************************
//
// This is the handler for INT_GPIOB. 
// IntGPIOa would trigger this.
//
//*****************************************************************************
void IntGPIOd(void)
{

    // Not necessarily needed.
    // Set PD2 high to indicate entry to this interrupt handler.
    //
    GPIOPinWrite(GPIO_PORTB_BASE, GPIO_PIN_2, GPIO_PIN_2);

    // Not necessarily needed.
    // Put the current interrupt state on the OLED.
    //
    DisplayIntStatus();

	disableInterrupts();
	// fire the event sent by GPIOa.
    (*IntFuncPtr[3])(IntActorArg[3]);

	enableInterrupts();

	STOP_SOURCE_PROCESS = TRUE;

	// then do processAvailableEvents();	 				 	
	processAvailableEvents();

    // Put the current interrupt state on the OLED.
    //
    DisplayIntStatus();

    // Not necessary
    // Set PD2 low to indicate exit from this interrupt handler.
    //
    GPIOPinWrite(GPIO_PORTB_BASE, GPIO_PIN_2, 0);

	InterruptPriorityLevel--;
}

//*****************************************************************************
//
// This is the handler for INT_GPIOB. 
// IntGPIOa would trigger this.
//
//*****************************************************************************
void IntGPIOc(void)
{

