icyphy/ptII/ptolemy/apps/ptidesBareIron/PtidesOS/boards/ek-lm3s8962/SimplePtidesOS/SimplePtidesOS.c
    // Not necessarily needed.
    // Set PD2 high to indicate entry to this interrupt handler.
    //
    GPIOPinWrite(GPIO_PORTB_BASE, GPIO_PIN_2, GPIO_PIN_2);

    // Not necessarily needed.
    // Put the current interrupt state on the OLED.
    //
    DisplayIntStatus();

	disableInterrupts();
	// fire the event sent by GPIOa.
    (*IntFuncPtr[4])(IntActorArg[4]);

	enableInterrupts();

	STOP_SOURCE_PROCESS = TRUE;

	// then do processAvailableEvents();	 				 	
	processAvailableEvents();

    // Put the current interrupt state on the OLED.
    //
    DisplayIntStatus();

    // Not necessary
    // Set PD2 low to indicate exit from this interrupt handler.
    //
    GPIOPinWrite(GPIO_PORTB_BASE, GPIO_PIN_2, 0);

	InterruptPriorityLevel--;
}

//*****************************************************************************
//
// This is the handler for INT_GPIOB. 
// IntGPIOa would trigger this.
//
//*****************************************************************************
void IntGPIOb(void) 
{

    // Not necessarily needed.
    // Set PD2 high to indicate entry to this interrupt handler.
    //
    GPIOPinWrite(GPIO_PORTB_BASE, GPIO_PIN_2, GPIO_PIN_2);

    // Not necessarily needed.
    // Put the current interrupt state on the OLED.
    //
    DisplayIntStatus();

	disableInterrupts();
	// fire the event sent by GPIOa.
    (*IntFuncPtr[5])(IntActorArg[5]);

	enableInterrupts();

	STOP_SOURCE_PROCESS = TRUE;

	// then do processAvailableEvents();	 				 	
	processAvailableEvents();

    // Put the current interrupt state on the OLED.
    //
    DisplayIntStatus();

    // Not necessary
    // Set PD2 low to indicate exit from this interrupt handler.
    //
    GPIOPinWrite(GPIO_PORTB_BASE, GPIO_PIN_2, 0);

	InterruptPriorityLevel--;
}

//*****************************************************************************
//
// This is the handler for INT_GPIOA. 
// Whenver a sensor senses data and triggers interrupt, GPIOA is called.
// It triggers INT_GPIO{B..G} and keeps track how many interrupts it has allocated.
//
//*****************************************************************************
void IntGPIOa(void)
{
	// We disable interrupt here to make sure only this current triggered ISR
	// updates InterruptPriorityLevel, though this may not be necessary.
	disableInterrupts();
    // Not necessarily needed.
    // Set PD2 high to indicate entry to this interrupt handler.
    //
    GPIOPinWrite(GPIO_PORTB_BASE, GPIO_PIN_2, GPIO_PIN_2);

    // Not necessarily needed.
    // Put the current interrupt state on the OLED.
    //
    DisplayIntStatus();

	// set the correct function pointer	
	// FIXME: HOW DO I ACTUALLY TELL WHERE THIS INTERRUPT CAME FROM?
	if (TimerInterrupt == TRUE) {
		IntFuncPtr[InterruptPriorityLevel] = &timerHandler;
		IntActorArg[InterruptPriorityLevel] = NULL;
	} else {
		IntFuncPtr[InterruptPriorityLevel] = &fireSensor;
		IntActorArg[InterruptPriorityLevel] = SENSOR1;
	}
	 
    //
    // Trigger an interrupt of lower priority interrupt.
    //
    HWREG(NVIC_SW_TRIG) = DynamicInterrupts[InterruptPriorityLevel] - 16;
	InterruptPriorityLevel++;

    //
    // Put the current interrupt state on the OLED.
    //
    DisplayIntStatus();

    // Not necessary
    // Set PD2 low to indicate exit from this interrupt handler.
    //
    GPIOPinWrite(GPIO_PORTB_BASE, GPIO_PIN_2, 0);
	enableInterrupts();
}

//returns the minimum of val1 and val2
long min(long val1, long val2)
{
	if(val1 < val2)
		return val1;

	return val2;

}

Event * newEvent(void)
{
RIT128x96x4StringDraw("bne",12,12,15);
//RIT128x96x4StringDraw(itoa(locationCounter,10), 30,12,15);
//printf("location counter is %d",locationCounter);
	while(eventMemory[locationCounter].inUse != 36 )
	{  
	   ASSERT(locationCounter != 35)  // if you've run out of memory just stop
	//  printf("locationCounter %d",locationCounter);
	   locationCounter++;
	}
	locationCounter%=35;  // make it circular
//	RIT128x96x4StringDraw(itoa(locationCounter,10), 0,0,15);
	return &eventMemory[locationCounter];
	
}



/**
 * This function is almost the same as processEvents, only that this function is called within interrupt service
 * routines. When an event is not safe to process, or alreadyingFiring() is true, we return from this function,
 * instead of waiting for events to process. We also do not deal with source actors within this process
 *
 * Also, maybe we should have a seperate event queue for events generated here...? Depends on what we really want.
 */
void processAvailableEvents(void)
{  
// should this be given a parameter for the event that was just created in the ISR that calls this function?
   // I am possibly wrong... but I thought the reason for having this was to check to see if its safe to process the event just generated

    //  To ensure this function is thread safe, we make sure only one processEvents() IS BEING EXECUTED AT A TIME
    //  WHILE ANOTHER SENSOR MIGHT TRIGGER ANOTHER processEvents()
    //  IF ANOTHER processEvents() is currently being executed, we don't really need to have another being executed at the same time...
	Actor* actor;
	Event* event;
//    while (1) 
//	{
        // If event queue is not empty.
    while (EVENT_QUEUE_HEAD != NULL) 
	{
		disableInterrupts();
		event = EVENT_QUEUE_HEAD;
        // Check which actor produced the event that we have processed			
		actor = event->actorFrom;
		// FIXME: ALSO check if an event is of higher priority here.
		if (higherPriority(actor) == FALSE) {
			enableInterrupts();
			break;
		} 
		else 
		{
            long processTime = safeToProcess(event);
            if (getCurrentPhysicalTime() >= processTime) 
			{
                removeEvent();
				currentlyFiring(actor);
                enableInterrupts();
                // Execute the event. During
                // this process more events may
                // be posted to the queue.
                fireActor(event);
				freeEvent(event);
                // If the event just executed is
                // produced by a source actor
                if (actor->sourceActor != 0) {
                    // Decrement the buffer size
                    // by one.
					if (actor == SOURCE1) {
                    	CK1_BUF_SIZE--;
					}
                    // Make sure sourceBuffer is
                    // non-empty. If it is, fire
                    // the source actor once to
                    // produce some events.
                    if (CK1_BUF_SIZE == 0) {
						//dummyEVent is never used.
						Event* dummyEvent;
                        fireClock(SOURCE1, dummyEvent);
						// firing of the actor should update the number of events in the buffer
                    }
                }
            }
            else {
//					// leave it for processEvents() to figure out what to do with source processes.
//					enableInterrupts();
//					break;
//	                // There are no events safe to
//	                // process, so setup sources
//	                // to process.
//	                STOP_SOURCE_PROCESS = FALSE;
                // Set timed interrupt to run
                // the event at the top of the
                // event queue when physical time
                // has passed for it to be
                // safe to process
                setTimedInterrupt(processTime);
                enableInterrupts();
				break;
            }
		}

