icyphy/ptII/ptolemy/apps/ptidesBareIron/PtidesOS/boards/ek-lm3s8962/SimplePtidesOS/SimplePtidesOS.c
    } 
	// leave it for processEvents() to figure out what to do with source processes.
	//enableInterrupts();
	return;
//            // There are no events safe to
//            // process, so setup sources
//            // to process.
//            STOP_SOURCE_PROCESS = FALSE;
//            enableInterrupts();

// leave it for processEvents() to figure out what to do with source processes.
//        // If there is no event to process and we
//        // have not reached the buffer limit, fire
//        // the source actor.
//        // for (each source actors a) {
//        if (STOP_SOURCE_PROCESS == FALSE) {
//			if (CK1_BUF_SIZE < MAX_BUFFER_LIMIT) {
//				Event* dummyEvent;
//            	fireClock(SOURCE1, dummyEvent);
//			}
//        }
//    }
} 
void processEvents()
{
   
    //  To ensure this function is thread safe, we make sure only one processEvents() IS BEING EXECUTED AT A TIME
    //  WHILE ANOTHER SENSOR MIGHT TRIGGER ANOTHER processEvents()
    //  IF ANOTHER processEvents() is currently being executed, we don't really need to have another being executed at the same time...
	Actor* actor;
	int whilecount = 0;
	//RIT128x96x4StringDraw("beginningPE", 12,48,15);
    //printf("at beginning of Process Events");
    while (1) 
	{
		whilecount++;
		sprintf(str,"%d",whilecount);
    	RIT128x96x4StringDraw("topOfWhile", 12,80,15);
		RIT128x96x4StringDraw(str, 90,80,15);
        disableInterrupts();
        // If event queue is not empty.
		
        if (EVENT_QUEUE_HEAD != NULL) {
            Event* event = EVENT_QUEUE_HEAD;
            // Check which actor produced the event that we have processed
			actor = event->actorFrom;
			// FIXME: since there is only one instance of processing events running, we don't need
			// the check for alreadyFiring(), in other words, alreadyFiring should always be false.
			if (higherPriority(actor) == 1) {
				//enableInterrupts();
				//break;
				die("this is the base processEvents routine, should not have another event of higher priority.");
			} else {
	            long long processTime = safeToProcess(event);
	            if (getCurrentPhysicalTime() >= processTime) {
	                removeEvent();
					currentlyFiring(actor);
	                enableInterrupts();
	                // Execute the event. During
	                // this process more events may
	                // be posted to the queue.
	                fireActor(event);
					freeEvent(event);
	                // If the event just executed is
	                // produced by a source actor
	                 /* if (actor->sourceActor != 0) 
					  {
	                    // Decrement the buffer size
	                    // by one.
						if (actor == SOURCE1) 
						{
	                    	CK1_BUF_SIZE--;
						}
	                    // Make sure sourceBuffer is
	                    // non-empty. If it is, fire
	                    // the source actor once to
	                    // produce some events.
	                    if (CK1_BUF_SIZE == 0) 
						{
							//dummyEVent is never used.
							Event* dummyEvent;
	                        fireClock(SOURCE1, dummyEvent);
							// firing of the actor should update the number of events in the buffer
	                    }
	                  }*/
					 }//end if currentPhysicalTime >= processTime
					 else 
			    	{
	                // There are no events safe to
	                // process, so setup sources
	                // to process.
	                STOP_SOURCE_PROCESS = FALSE;
	                // Set timed interrupt to run
	                // the event at the top of the
	                // event queue when physical time
	                // has passed for it to be
	                // safe to process
	                setTimedInterrupt(processTime);
	                enableInterrupts();
	            	}// end !(curentPhysicalTime >= processTime)

					}//end else notalreadyfiring
				 }//end EVENT_QUEUE_HEAD != NULL
				 else 
				 {
           		   // There are no events safe to
            	   // process, so setup sources
            	   // to process.
            	   STOP_SOURCE_PROCESS = FALSE;
            	   enableInterrupts();
        		}
	           
			
		// If there is no event to process and we
        // have not reached the buffer limit, fire
        // the source actor.
        // for (each source actors a) {
        if (STOP_SOURCE_PROCESS == FALSE) 
        {
			if (CK1_BUF_SIZE < MAX_BUFFER_LIMIT) 
             {
		     	Event* dummyEvent;
            	//fireClock(SOURCE1, dummyEvent);   
			}
        }
	   if(EVENT_QUEUE_HEAD == NULL)
	   break;
      
	  }//end while(1)
//		whilecount++;
//		sprintf(str,"%d",whilecount);
//    RIT128x96x4StringDraw("bottomOfWhile", 12,80,15);
//	RIT128x96x4StringDraw(str, 90,80,15);
   //printf("at bottom of while loop in process Events");

}

/** 
 * removeEvent() is called to pop the most recent event in the event queue.
 * it is not interlocked because it can only be called by sinks within a 
 * platform, which is the called by processEvents().
 * Here the first event on the event queue is popped.
 */
void removeEvent()   // may need to be modified since there is a deadline queue... not sure how yet
{
    if (EVENT_QUEUE_HEAD != NULL)
	{	removecount++;
		//should I call freeEvent(EVENT_QUEUE_HEAD) here? I'm not sure.
		freeEvent(EVENT_QUEUE_HEAD);
        EVENT_QUEUE_HEAD = EVENT_QUEUE_HEAD -> next;
		if(removecount==addeventcount)
		{
		 EVENT_QUEUE_HEAD = NULL;
		}
		//printf("Just removed an event\n");
		RIT128x96x4StringDraw("remEventCount",0,0,15);
		sprintf(str,"%d",removecount);
		RIT128x96x4StringDraw(str,   35,0,15);
    } 
    else printf("event queue is already empty\n");

	
}
/** 
 * Static timing analysis is called to set the timestamp of the event by a 
 * specific amount in order to fire the event at an instance that ensures 
 * all events are exectued in order.
 * In this analysis, the clock event can be executed when real time exceeds
 * tau - model_delay3
 */
long long safeToProcess(Event* thisEvent) 
{
    long long safeTimestamp = thisEvent->Tag.timestamp;

