icyphy/ptII/ptolemy/apps/ptidesBareIron/PtidesOS/boards/ek-lm3s8962/SimplePtidesOS/SimplePtidesOS.c
	if (thisEvent->actorToFire->multipleInputs != 0) 
	{
	    if (thisEvent->actorToFire->fireMethod == fireMerge)
		{
			safeTimestamp -= MERGE_MODEL_TIME_ADJUSTMENT; 
		} 
		else if (thisEvent->actorToFire->fireMethod == fireComputation)
	    {        
	    	safeTimestamp -= COMPUTATION_MODEL_TIME_ADJUSTMENT;
		}
    }
	 else 
	 {
//        printf("always safe to execute, so set safeTag to 0\n");
        safeTimestamp = 0;
    }

    return safeTimestamp;
}

// FIXME
void setActuationInterrupt(long long actuationTime) 
{
	return;
}

// FIXME
void setTimedInterrupt(long long safeToProcessTime) 
{
	
	// If timer already running
	// check if need to reload the interrupt value.
	// If not
	// Set it up to run.
	//set timer0 as a periodic 32 bit timer
	// FIXME: does TiemrValueGet() return 0 if timer is not on?
	long long restOfTimer = timerInterruptTimes * TIMER_ROLLOVER_CYCLES;
	restOfTimer += TimerValueGet(TIMER0_BASE, TIMER_A);

	if (restOfTimer <= 0) {
		// Timer not running. setup a new timer value and start timer.
	
		TimerConfigure(TIMER0_BASE, TIMER_CFG_32_BIT_OS);
	    // interrupt 10 times per second
	    TimerLoadSet(TIMER0_BASE, TIMER_BOTH, safeToProcessTime % TIMER_ROLLOVER_CYCLES);
		timerInterruptTimes = safeToProcessTime / TIMER_ROLLOVER_CYCLES;
	
		//
		//Setup the interrupts for the timer timeouts
		//
	    IntEnable(INT_TIMER0A);
		IntEnable(INT_TIMER0B);
		TimerIntEnable(TIMER0_BASE,TIMER_TIMA_TIMEOUT);
		//TimerIntEnable(TIMER0_BASE,TIMER_TIMB_TIMEOUT);
	
	    // Enable the timers.
	    //
	    TimerEnable(TIMER0_BASE, TIMER_BOTH);
		return;

	} else {
		// Timer already running, check to see if we need to reload timer value.
		if (restOfTimer > safeToProcessTime) {
			TimerDisable(TIMER0_BASE, TIMER_BOTH);
						
	    	TimerLoadSet(TIMER0_BASE, TIMER_BOTH, safeToProcessTime % TIMER_ROLLOVER_CYCLES);	
			timerInterruptTimes = safeToProcessTime / TIMER_ROLLOVER_CYCLES;

	    	TimerEnable(TIMER0_BASE, TIMER_BOTH);
		} // else we don't need to reload the timer.

	}
}






// This handler is called when GPIOa realizes we need to trigger timerHandler.

//*****************************************************************************
//
// The interrupt handler for the SystemTick
//
//*****************************************************************************
void SysTickHandler(void)
{
  //what should I do to clear the SysTick Interrupt?
  //does it not need to be cleared?

  //RIT128x96x4StringDraw("in systick handler",            12,  0, 15);
  
   seconds++;

}

//*****************************************************************************
//
// The interrupt handler for the first timer interrupt.
// Time0 counts down until we are safe to process.
// FIXME: make sure only one timer0 runs at a time.
// FIXME: need to set timer0 to be higher priority than GPIOa
//
//*****************************************************************************
// mthomas: attribute for stack-aligment (see README_mthomas.txt)
//#ifdef __GNUC__
//void Timer0IntHandler(void) __attribute__((__interrupt__));
//#endif
void Timer0IntHandler(void)
{
    //
    // Clear the timer interrupt.
    //
    TimerIntClear(TIMER0_BASE, TIMER_TIMA_TIMEOUT);
//	RIT128x96x4Clear();
	if (timerInterruptTimes > 0) {
		timerInterruptTimes--;
		return;
	}

	// set GPIOA interrupt
    // Trigger the INT_GPIOA interrupt.
    //
    HWREG(NVIC_SW_TRIG) = INT_GPIOA - 16;
	// set TIMER_HANDLER so we know to timerHandler should be triggered by GPIOa.
	TimerInterrupt = TRUE;

	//
	//Setup the interrupts for the timer timeouts
	//
	TimerDisable(TIMER0_BASE, TIMER_BOTH);
    IntDisable(INT_TIMER0A);
	IntDisable(INT_TIMER0B);
	//FIXME: is this correct?
	TimerIntDisable(TIMER0_BASE, TIMER_TIMA_TIMEOUT);
	TimerIntDisable(TIMER0_BASE, TIMER_TIMB_TIMEOUT);
    // Disable the timers.
    //

}

//*****************************************************************************
//
// The interrupt handler for the second timer interrupt.
//
//*****************************************************************************
// mthomas: attribute for stack-aligment (see README_mthomas.txt)
//#ifdef __GNUC__
//void Timer1IntHandler(void) __attribute__((__interrupt__));
//#endif
void Timer1IntHandler(void)
{
    //
    // Clear the timer interrupt.
    //
    TimerIntClear(TIMER1_BASE, TIMER_TIMA_TIMEOUT);
    // RIT128x96x4Clear();
    //
    // Toggle the flag for the second timer.
    //
    HWREGBITW(&g_ulFlags, 1) ^= 1;

    //
    // Update the interrupt status on the display.
    //
  //  IntMasterDisable();
//	modeltime++;
    //RIT128x96x4StringDraw(HWREGBITW(&g_ulFlags, 1) ? "1" : "0",        12, 48, 15);
//	RIT128x96x4StringDraw("modeltime ",        12, 48, 15);
//	RIT128x96x4StringDraw(itoa(modeltime,10),  50, 48, 15);
    //IntMasterEnable();
}


// FIXME: when can we get rid of this function?
void timerHandler(Actor * dummyActor) {
	
    //IntMasterEnable();
	// FIXME: is this needed here?
	// If we set sources as the lowest priorities, then we'll always be able to process within this
	// interrupt service routine, so this wouldn't be needed... correct?
	STOP_SOURCE_PROCESS = TRUE;

	// the interrupt handler will call processAvailableEvents();
	// processAvailableEvents();
	return;
}
// FIXME...
void timerInit(void) {

}

//*****************************************************************************
// FIXME: I need to decide what the UARET is really for, or maybe I should just get rid of it?
// The UART interrupt handler.
//
//*****************************************************************************
void UARTIntHandler(void)
{
    unsigned long ulStatus;
	Event* dummyEvent;
	
	disableInterrupts();

    //
    // Get the interrrupt status.
    //
    ulStatus = UARTIntStatus(UART0_BASE, true);
    //
    // Clear the asserted interrupts.
    //
    UARTIntClear(UART0_BASE, ulStatus);

	fireClock(SOURCE1, dummyEvent);

	enableInterrupts();
	
	processAvailableEvents();	

	// If processEvents() is currently trying
    // to fill the output buffer of source
    // actors, go back to the start of
    // while(TRUE) in processEvents().		
	STOP_SOURCE_PROCESS = TRUE;
}
/**
 * main() has the following functionalities:
 * declare all actors
 * setup dependencies between the actors
 * intialize actors
 */
int main(void)
{

