icyphy/ptII/ptolemy/apps/ptidesBareIron/PtidesOS/boards/ek-lm3s8962/SimplePtidesOS/SimplePtidesOS.c
    //**************************************************
    //Declare all actors
    Actor sensor1;
	Actor sensor2;
    Actor clock1;
	Actor computation1;
	Actor computation2;
	Actor computation3;
    Actor merge1;
    Actor model_delay1;
	Actor model_delay2;
    Actor model_delay3;
    Actor actuator1;

	//to test deadline calculation example
	Actor sensor0;
	Actor computation0;
	Actor delay1;
	Actor delay2;
	Actor actuator01;
	Actor actuator02;





	locationCounter = 0;
	//****************************************************
	//set actor types
	sensor1.type = 's';
	sensor2.type = 's';
    clock1.type = 'k';
	computation1.type = 'c';
	computation2.type = 'c';
	computation3.type = 'c';
    merge1.type = 'm';
    model_delay1.type = 'd';
	model_delay2.type = 'd';
    model_delay3.type = 'd';
    actuator1.type = 'a';
	// set model delay
    sensor1.model_delay = 0;;
	sensor2.model_delay = 0;
    clock1.model_delay = 0;;
	computation1.model_delay = 0;
	computation2.model_delay = 0;
	computation3.model_delay = 0;
    merge1.model_delay = 0;
    model_delay1.model_delay = 1;
	model_delay2.model_delay = 2;
	model_delay3.model_delay = 3;
    actuator1.model_delay = 0;


	// this example was constructed to help with the deadline calculation

	sensor0.type ='s';
	sensor0.model_delay = 0;
	computation0.type = 'c';
	computation0.model_delay = 0;
	delay1.type = 'd';
	delay1.model_delay = 5;
	delay2.type = 'd';
	delay2.model_delay = 3;
	actuator01.type = 'a';
	actuator01.model_delay = 0;
	actuator02.type = 'a';
	actuator02.model_delay = 0;


	// set the fire methods here
    // as well as firing value

	sensor0.nextActor1 = &computation0;
	sensor0.nextActor2 = NULL;
	computation0.nextActor1 = &delay1;
	computation0.nextActor2 = &delay2;
	delay1.nextActor1 = &actuator01;
	delay1.nextActor2 = NULL;
	delay2.nextActor1 = &actuator02;
	delay2.nextActor2 = NULL;

	



	/*************************************************************************/
	// Utilities to setup interrupts
    //
    // Enable the peripherals used by this example.
    //
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOA);
	SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOB);
	SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOC);
	SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOD);
	SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOE);
	SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOF);
	SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOG);
	SysCtlPeripheralEnable(SYSCTL_PERIPH_TIMER0);

	//
    // Set the clocking to run directly from the crystal.
    //
    SysCtlClockSet(SYSCTL_SYSDIV_1 | SYSCTL_USE_OSC | SYSCTL_OSC_MAIN |
                   SYSCTL_XTAL_8MHZ);	   // 8MHZ is the fastest the clock can run.
	 //
    // Initialize the OLED display and write status.
    //
    RIT128x96x4Init(1000000);
    RIT128x96x4StringDraw("PtidyRTOSv0.1",            36,  0, 15);
  //  printf("PtidyRTOSv0.1\n");	
	/*
	//
    // Enable processor interrupts.
    //
    IntMasterEnable();	
    //
    // Set GPIO A0 and A1 as UART pins.
    //
    GPIOPinTypeUART(GPIO_PORTA_BASE, GPIO_PIN_0 | GPIO_PIN_1);
	//
    // Configure the UART for 115,200, 8-N-1 operation. 
	// FIXME: don't know what this is for...
    //
    UARTConfigSetExpClk(UART0_BASE, SysCtlClockGet(), 115200,
                        (UART_CONFIG_WLEN_8 | UART_CONFIG_STOP_ONE |
                         UART_CONFIG_PAR_NONE));
    //
    // Enable the UART interrupt.
    //
    IntEnable(INT_UART0);
    UARTIntEnable(UART0_BASE, UART_INT_RX | UART_INT_RT);
	
	//setup and enable the SysTickTimer. It will be used as a reference for delay loops in interrupt handlers. 
	//The SysTick timer period will be set for one second
	SysTickPeriodSet(SysCtlClockGet());  
	SysTickEnable();
	IntEnable(15);  //sys tick vector

    //TimerEnable(TIMER1_BASE, TIMER_A);
//	RIT128x96x4StringDraw("beforeinit", 12,24,15);
	//IEEE1588Init();     //when this is uncommented I don't see the ouptut below..
	//RIT128x96x4StringDraw("AIEEEinit", 36,24,15);	   
	initializeMemory();
	
	SOURCE1 = &clock1;
	SENSOR1 = &sensor1;
	SENSOR2 = &sensor2;

	clock1.fireMethod = fireClock;

	computation1.fireMethod = fireComputation;
	computation1.firing = 0;

	computation2.fireMethod = fireComputation;
	 computation2.firing = 0;
	computation3.fireMethod = fireComputation;
	computation3.firing = 0;
	model_delay1.fireMethod = fireModelDelay;
	model_delay1.firing = 0;
	model_delay2.fireMethod = fireModelDelay;
   	model_delay1.firing = 0;
	model_delay3.fireMethod = fireModelDelay;	// should model delay be used in this example?
	model_delay3.firing = 0;
	merge1.fireMethod = fireMerge;
	merge1.firing = 0;
	actuator1.fireMethod = fireActuator;
   	actuator1.firing = 0;  
    //Dependencies between all the actors
	//FIXME: HOW ARE PORTS NUMBERED??
    sensor1.nextActor1 = &computation1;
    sensor1.nextActor2 = NULL;
    computation1.nextActor1 = &model_delay1;
    computation1.nextActor2 = NULL;
	model_delay1.nextActor1 = &merge1;
	model_delay1.nextActor2 = NULL;

    sensor2.nextActor1 = &computation2;
    sensor2.nextActor2 = NULL;
    computation2.nextActor1 = &model_delay2;
    computation2.nextActor2 = NULL;
	model_delay2.nextActor1 = &merge1;
	model_delay2.nextActor2 = NULL;
    
    clock1.nextActor1 = &computation3;
    clock1.nextActor2 = NULL;
    computation3.nextActor1 = &model_delay3;
    computation3.nextActor2 = NULL;
	model_delay3.nextActor1 = &merge1;
	model_delay3.nextActor2 = NULL;
    
    merge1.nextActor1 = &actuator1;
    merge1.nextActor2 = NULL;

    actuator1.nextActor1 = NULL;
    actuator1.nextActor2 = NULL;

    

    initializeClock(&clock1); */

	deadline(&sensor0);
    // RIT128x96x4StringDraw("afterinitClk", 12,36,15);
	//fireSensor(&sensor1);
	//RIT128x96x4StringDraw("afterinitS1",   12,48,15);
	//RIT128x96x4StringDraw("!!!!!!!!!!!!!!!!!!!!",      12,72,15);					  
 	//fireSensor(&sensor2);
	//RIT128x96x4StringDraw("afterinitS2",   12,60,15);
	//RIT128x96x4StringDraw("beforePE",   12,36,15);	
    //processEvents();
	while(1);
	 
