icyphy/ptII/ptolemy/apps/ptidesBareIron/PtidesOS/boards/ek-lm3s8962/SimplePtidesOS/SimplePtidesOS.c
	return 0;
}

//*****************************************************************************
//
// This function will set the local time (provided in PTPd internal time
// format).  This time is maintained by the SysTick interrupt.
//
//*****************************************************************************
void setTime(TimeInternal *time)
{
    sys_prot_t sProt;

    //
    // Update the System Tick Handler time values from the given PTPd time
    // (fine-tuning is handled in the System Tick handler). We need to update
    // these variables with interrupts disabled since the update must be
    // atomic.
    //
#ifdef DEBUG
    UARTprintf("Setting time %d.%09d\n", time->seconds, time->nanoseconds);
#endif
    sProt = sys_arch_protect();
    g_ulSystemTimeSeconds = time->seconds;
    g_ulSystemTimeNanoSeconds = time->nanoseconds;
    sys_arch_unprotect(sProt);
}

//*****************************************************************************
//
// This function returns the local time (in PTPd internal time format).  This
// time is maintained by the SysTick interrupt.
//
// Note: It is very important to ensure that we detect cases where the system
// tick rolls over during this function. If we don't do this, there is a race
// condition that will cause the reported time to be off by a second or so
// once in a blue moon. This, in turn, causes large perturbations in the
// 1588 time controller resulting in large deltas for many seconds as the
// controller tries to compensate.
//
//*****************************************************************************
void getTime(TimeInternal *time)
{
	getCurrentPhysicalTime();
//    unsigned long ulTime1;
//    unsigned long ulTime2;
//    unsigned long ulSeconds;
//    unsigned long ulPeriod;
//    unsigned long ulNanoseconds;
//
//    //
//    // We read the SysTick value twice, sandwiching taking snapshots of
//    // the seconds, nanoseconds and period values. If the second SysTick read
//    // gives us a higher number than the first read, we know that it wrapped
//    // somewhere between the two reads so our seconds and nanoseconds
//    // snapshots are suspect. If this occurs, we go round again. Note that
//    // it is not sufficient merely to read the values with interrupts disabled
//    // since the SysTick counter keeps counting regardless of whether or not
//    // the wrap interrupt has been serviced.
//    //
//    do
//    {
//        ulTime1 = SysTickValueGet();
//        ulSeconds = g_ulSystemTimeSeconds;
//        ulNanoseconds = g_ulSystemTimeNanoSeconds;
//        ulPeriod = SysTickPeriodGet();
//        ulTime2 = SysTickValueGet();
//
//#ifdef DEBUG
//        //
//        // In debug builds, keep track of the number of times this function was
//        // called just as the SysTick wrapped.
//        //
//        if(ulTime2 > ulTime1)
//        {
//            g_ulSysTickWrapDetect++;
//            g_ulSysTickWrapTime = ulSeconds;
//        }
//#endif
//    }
//    while(ulTime2 > ulTime1);
//
//    //
//    // Fill in the seconds field from the snapshot we just took.
//    //
//    time->seconds = ulSeconds;
//
//    //
//    // Fill in the nanoseconds field from the snapshots.
//    //
//    time->nanoseconds = (ulNanoseconds + (ulPeriod - ulTime2) * TICKNS);
//
//    //
//    // Adjust for any case where we accumulate more than 1 second's worth of
//    // nanoseconds.
//    //
//    if(time->nanoseconds >= 1000000000)
//    {
//#ifdef DEBUG
//        g_ulGetTimeWrapCount++;
//#endif
//        time->seconds++;
//        time->nanoseconds -= 1000000000;
//    }
}

//*****************************************************************************
//
// Get the RX Timestamp. This is called from the lwIP low_level_input function
// when configured to include PTPd support.
//
//*****************************************************************************
void getRxTime(TimeInternal *psRxTime)
{
    unsigned long ulNow;
    unsigned long ulTimestamp;
    //
    // Get the current IEEE1588 time.
    //
    getTime(psRxTime);

    //
    // If we are using the hardware timestamp mechanism, get the timestamp and
    // use it to adjust the packet timestamp accordingly.
    //
    if(HWREGBITW(&g_ulFlags, FLAG_HWTIMESTAMP))
    {
        //
        // Read the (now frozen) timer value and the still-running timer.
        //
        ulTimestamp = TimerValueGet(TIMER3_BASE, TIMER_B);
        ulNow = TimerValueGet(TIMER3_BASE, TIMER_A);

        //
        // Adjust the current time with the difference between now and the
        // actual timestamp.
        //
        adjust_rx_timestamp(psRxTime, ulTimestamp, ulNow);
    }

    return;
}


//*****************************************************************************
//
// Initialization code for PTPD software.
//
//*****************************************************************************


//*****************************************************************************
//
// The interrupt handler for the SysTick interrupt.
//
//*****************************************************************************
void SysTickIntHandler(void)
{
    //
    // Update internal time and set PPS output, if needed.
    //
    g_ulSystemTimeNanoSeconds += SYSTICKNS;
    if(g_ulSystemTimeNanoSeconds >= 1000000000)
    {							   
        GPIOPinWrite(PPS_GPIO_BASE, PPS_GPIO_PIN, PPS_GPIO_PIN);
        g_ulSystemTimeNanoSeconds -= 1000000000;
        g_ulSystemTimeSeconds += 1;
        HWREGBITW(&g_ulFlags, FLAG_PPSOUT) = 1;
    }

    //
    // Set a new System Tick Reload Value.
    //
    if(g_ulSystemTickReload != g_ulNewSystemTickReload)
    {
        g_ulSystemTickReload = g_ulNewSystemTickReload;

        g_ulSystemTimeNanoSeconds = ((g_ulSystemTimeNanoSeconds / SYSTICKNS) *
                                     SYSTICKNS);
    }

    //
    // For each tick, set the next reload value for fine tuning the clock.
    //
    if((g_ulSystemTimeTicks % TICKNS) < g_ulSystemTickHigh)
    {
        SysTickPeriodSet(g_ulSystemTickReload + 1);
    }
    else
    {
        SysTickPeriodSet(g_ulSystemTickReload);
    }

    //
    // Service the PTPd Timer.
    //
    timerTick(SYSTICKMS);

    //
    // Increment the run-time tick counter.
    //
    g_ulSystemTimeTicks++;

    //
    // Clear the SysTick interrupt flag.
    //
    HWREGBITW(&g_ulFlags, FLAG_SYSTICK) = 0;

    //
    // Run the Luminary lwIP system tick.
    //
    lwip_tick(SYSTICKMS);

