icyphy/ptII/ptolemy/apps/ptidesBareIron/PtidesOS/boards/ek-lm3s8962/SimplePtidesOS/SimplePtidesOS.c
// Do we want this? each second provide an GPIO output?
//    //
//    // Setup to disable the PPS output on the next pass.
//    //
//    if(HWREGBITW(&g_ulFlags, FLAG_PPSOUT))
//    {
//        //
//        // Setup to turn off the PPS output.
//        //
//        HWREGBITW(&g_ulFlags, FLAG_PPSOUT) = 0;
//        HWREGBITW(&g_ulFlags, FLAG_PPSOFF) = 1;
//    }

    //
    // Check if an RX Packet was received.
    //
    if(HWREGBITW(&g_ulFlags, FLAG_RXPKT))
    {
        //
        // Clear the Rx Packet interrupt flag.
        //
        HWREGBITW(&g_ulFlags, FLAG_RXPKT) = 0;

        //
        // Run the Luminary lwIP system tick, but with no time, to indicate
        // an RX or TX packet has occurred.
        //
        lwip_tick(0);
    }

    //
    // Check if a TX Packet was sent.
    //
    if(HWREGBITW(&g_ulFlags, FLAG_TXPKT))
    {
        //
        // Clear the Tx Packet interrupt flag.
        //
        HWREGBITW(&g_ulFlags, FLAG_TXPKT) = 0;

        //
        // Run the Luminary lwIP system tick, but with no time, to indicate
        // an RX or TX packet has occurred.
        //
        lwip_tick(0);

        //
        // Enable Ethernet TX Packet Interrupts.
        //
        EthernetIntEnable(ETH_BASE, ETH_INT_TX);
    }

    //
    // If IP address has been assigned, initialize the PTPD software (if
    // not already initialized).
    //
    if(HWREGBITW(&g_ulFlags, FLAG_IPADDR) &&
       !HWREGBITW(&g_ulFlags, FLAG_PTPDINIT))
    {
        ptpd_init();
        HWREGBITW(&g_ulFlags, FLAG_PTPDINIT) = 1;
    }

    //
    // If PTPD software has been initialized, run the ptpd tick.
    //
    if(HWREGBITW(&g_ulFlags, FLAG_PTPDINIT))
    {
        ptpd_tick();
    }
}



//*****************************************************************************
//
// Display Date and Time.
//
//*****************************************************************************
static char g_pucBuf[23];
const char *g_ppcDay[7] =
{
    "Sun", "Mon", "Tue", "Wed", "Thu", "Fri", "Sat"
};
const char *g_ppcMonth[12] =
{
    "Jan", "Feb", "Mar", "Apr", "May", "Jun",
    "Jul", "Aug", "Sep", "Oct", "Nov", "Dec"
};
//*****************************************************************************
//
// Display Statistics.  For now, do nothing, but this could be used to either
// update a web page, send data to the serial port, or to the OLED display.
//
// Refer to the ptpd software "src/dep/sys.c" for example code.
//
//*****************************************************************************
void displayStats(RunTimeOpts *rtOpts, PtpClock *ptpClock)
{
}

